---
kind: property
id: P:Autodesk.Revit.DB.PrintParameters.OriginOffsetY
source: html/13d170ba-6415-f220-a557-7c24d201480c.htm
---
# Autodesk.Revit.DB.PrintParameters.OriginOffsetY Property

The User defined Y value of offset from left bottom corner. Unit is feet.

## Syntax (C#)
```csharp
public double OriginOffsetY { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown if PaperPlacement is not Margins and MarginType is not User defined type.